app/views/gossips/index.html.erb

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TOP SECRET"], ["content", "on est tous des patates au fond"], ["user_id", 1], ["created_at", "2022-05-10 01:03:10.113131"], ["updated_at", "2022-05-10 01:03:10.113131"]]
---

<% if @gossip.save %>

SELECT "gossips".* FROM "gossips"
---
<div class="row">
  <% Gossip.all.sort.each_with_index do |gossip, index|  %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <h5 class="card-title"><%= gossip.title %></h5>
          <p class="card-text"><%= gossip.user.first_name %></p>