app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id])