app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossip = Gossip.all

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TOP SECRET"], ["content", "on est tous des patates au fond"], ["user_id", 1], ["created_at", "2022-05-10 01:03:10.113131"], ["updated_at", "2022-05-10 01:03:10.113131"]]
---
  def create
    @gossip = Gossip.new(post_params)
    @gossip.user_id = current_user.id
    p @gossip
    if @gossip.save