app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "karinnightmarepanda@gmail.com"], ["LIMIT", 1]]
---
  def create
    puts "Session "
    @user = User.find_by(email: params[:email])