app/controllers/users_controller.rb

  def create
    @user = User.new(
      first_name: params[:first_name],
      last_name: params[:last_name],
      age: params[:age],
      description: params[:description],
      email: params[:email],
      password: params[:password],
      city_id: City.all.sample
    )
    p @user

    if @user.save
---
SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"